[
  {
    "name_video": "Garry's Channel: LEARN, EARN or QUIT | My job and career advice",
    "description_video": "If you're not learning AND earning... it's time to move on.",
    "related_categories": [],
    "page_url": "/library/Jg-garry-s-channel-learn-earn-or-quit-my-job-career-advice",
    "youtube_url": "https://youtube.com/watch?v=eLelgy5zRv4",
    "mp3_file": "downloaded/Garry's_Channel:_LEARN,_EARN_or_QUIT_|_My_job_and_career_advice.mp3",
    "mp3_content": "Speaker 0: Are you learning\nSpeaker 0: or are you earning?\nSpeaker 0: If both, you're in a great place.\nSpeaker 0: If it's one or the other, that's good too.\nSpeaker 0: If it's neither,\nSpeaker 0: it's time to move on. You're wasting your life.\nSpeaker 0: Learn\nSpeaker 0: or earn. And if you're smart, hardworking, capable, and wanna learn more about being successful,\nSpeaker 0: and maybe even how to build a billion dollar startup,\nSpeaker 0: click subscribe and hit the bell icon right now. It's what we do every week right here. Let's get started.\nSpeaker 0: Learning is where you need to start. As early as possible and as quick as possible, it's important to become good at doing things. And that means either being a maker, which means design product and engineering,\nSpeaker 0: or being a hustler, management, sales and marketing.\nSpeaker 0: The majority of people starting out in their careers really need to focus on learning first. My friend Steven Snofsky says, this is the protein before the carbs.\nSpeaker 0: Alright, you say. How do you actually start? Well, first is learning about yourself. What do you like? What do you enjoy?\nSpeaker 0: What allows you to enter a state of flow?\nSpeaker 0: And then second, once you know that, you need to acquire those skills.\nSpeaker 0: Once you know you love design,\nSpeaker 0: can you spend the ten thousand hours it takes to become truly great at it? Well, if you answer that first part, the second part comes easy because you won't even feel the ten thousand hours. You'll just love doing it. Okay. Okay. I got it. No, really. What do I do, you ask? Well, if you want to be a hustler, you gotta learn to market or sell. Marketing is about helping other people communicate\nSpeaker 0: their problem and how their solution is the best. If you see a product, website or service that you like and you have some improvements you can suggest, you gotta build it or design it or write it yourself and then cold email them. Offer to do it or just do it and send it to them. Sales on the other hand is about getting customers. So go get those customers without even asking. Send those customers to a founder and they'll always take your email. They'll always remember you. It's a great way to break in. If you're a builder on the other hand, well, you've got to build.\nSpeaker 0: There's power in being able to do that yourself and not rely on others. Find a problem to solve and then build a first version that solves that problem.\nSpeaker 0: When you're starting out,\nSpeaker 0: it sort of maybe doesn't even matter what that problem exactly is. A lot of people get hung up on this step. They wait for the exact perfect problem. It just has to be a real problem that your software can actually solve.\nSpeaker 0: It's no mistake that some of the best founders I've met started off by making Gradebook software because they were still in school and they had access to teachers who were frustrated with their Gradebooks.\nSpeaker 0: Many of them didn't stay in that education space. They ended up making billion dollar companies in lots of other spaces, but they learned to create\nSpeaker 0: in grade book software.\nSpeaker 0: It's a great lesson. Creating, you can only learn by doing. So don't let the idea get in the way of you starting.\nSpeaker 0: Once you create something, anything, then iterate to make it work and turn it into something really good. When you create something impressive that users love, it's better than a credential. It doesn't matter if you didn't go to Stanford. If you can point to a beautiful app or website or GitHub repo with elegant code that you created,\nSpeaker 0: you have done a thing that will almost always set you up to be a top 10% player off the bat with no credentials.\nSpeaker 0: When I was 14, I got my first job cold calling the yellow pages in the internet section and what I had was a website I could point to that had won design awards. It was for my junior high school underground newspaper.\nSpeaker 0: You know, after that, I cold emailed my way to my first coding job. It worked for me and it'll work for you. Here's Bill Gates talking exactly about this, what it takes to create and learn how to be great at those things. If you spend ten thousand hours doing something, you'll be super good at it. I don't think that's quite\nSpeaker 1: as simple as that. What you do is you do about fifty hours\nSpeaker 1: and 90%\nSpeaker 1: drop out because they don't like it or they're not good. You know, you do another fifty hours and 90% drop out. So there's these constant cycles\nSpeaker 1: and\nSpeaker 1: you do have to be lucky enough, but also fanatical enough to keep going. And so the person who makes it to ten thousand hours is not just somebody who's done it for ten thousand hours,\nSpeaker 1: they're somebody who's chosen and been chosen\nSpeaker 1: in many different times.\nSpeaker 0: Bill Gates is absolutely right here. It's the ten thousand hours where you choose to do the same thing over and over again until you become great at it. That is learning.\nSpeaker 0: Let's talk about earning. What do I mean by earning? Well, I mean putting money in your pocket.\nSpeaker 0: What do you actually take home? The best way to do it, I think, is still equity.\nSpeaker 0: To make the most amount of money, you need to create true wealth by owning the stock of a company that became worth a lot of money. And when you started it, you owned a % of something that wasn't worth anything, but then you made it something. In my book, this is the highest form of earning because you made it. But of course, you can also earn cash.\nSpeaker 0: Facebook and Google pay engineers hundreds of thousands of dollars in cash and stock. And at the high end, it's not unusual for execs to make tens or hundreds of millions of dollars. That's crazy, but remember that Google made over a hundred $66,000,000,000\nSpeaker 0: in total revenue. If you divide that out by a 35,000\nSpeaker 0: employees,\nSpeaker 0: that's over 1,200,000.0\nSpeaker 0: per employee in revenue. That's an amazing way to earn, but sometimes there's a catch.\nSpeaker 0: What if you're not learning? I gotta say, this is my opinion and my opinion alone, but for me, I feel like I need to be learning something otherwise I'm dying. I'd be pretty unhappy in a place where I didn't get to learn about new things or grow my skills and abilities. That being said, let's take a step back.\nSpeaker 0: Millions, if not billions of people on the planet make this trade off every day, trading a portion of their happiness for financial stability. I'm not saying this is a bad situation.\nSpeaker 0: They can take care of themselves and their loved ones and that's important.\nSpeaker 0: But if you really want to take steps to create things from nothing, you gotta be careful. You might end up in a cycle, earn money to spend it to get a bigger house or car or nicer things.\nSpeaker 0: You'll spend more money and more money over time, and before you know it, you're running on a hedonic treadmill.\nSpeaker 0: And the tricky thing about spending money to buy things that you don't want is they don't give you the satisfaction you really want.\nSpeaker 0: Here's philosopher Alan Watts talking about exactly that.\nSpeaker 2: Money never can buy pleasure\nSpeaker 2: because all pleasures\nSpeaker 2: depend upon not putting down a symbol of power, money, but upon disciplines.\nSpeaker 2: In other words, now in Sausalito where I live,\nSpeaker 2: we have\nSpeaker 2: pier after pier full of fine boats,\nSpeaker 2: motor cruisers, sailing boats, all sorts of things, which nobody ever uses.\nSpeaker 2: Okay. Because they've been bought on the, falling for the ad line that if you buy this thing, will have pleasure. You will have status. You will have something or other. But then they suddenly discover that having a boat requires the art of seamanship,\nSpeaker 2: which is difficult but rewarding.\nSpeaker 2: Therefore, nobody has time for it, and all they do with the boat is have cocktail parties on them at the weekend.\nSpeaker 2: If\nSpeaker 0: you know you wanna create a startup, save the money. That boat or nice car or expensive clothes probably won't get you all the way to where you wanna be. If you're young and still thrifty, don't change your lifestyle.\nSpeaker 0: That money you spend needs to be saved so that you can invest your time in creating your own startup or your own wealth engine. I have one other big warning for you. Sometimes these high paying jobs that feel meaningless are bullshit jobs. Here's David Graeber, an intellectual of the Occupy Wall Street movement, talking about why some of these bullshit jobs exist. In the Soviet Union, they used to say, well, you know, we pretend to work and they pretend to pay us. They make up jobs which are completely unnecessary.\nSpeaker 3: That makes sense because they had an ideology of full employment.\nSpeaker 3: On the other hand, capitalism, that's exactly the thing that isn't supposed to happen. A private firm would never hire someone and put out good money to someone who they don't actually need. But in fact, if you talk to people who work for large corporations,\nSpeaker 3: they do it all the time. How does that happen?\nSpeaker 3: I think part of it has to be explained by political pressure. In a in a way, just as in the Soviet Union, there was a central directive saying,\nSpeaker 0: we need full employment. They didn't say, therefore, make up bullshit jobs. Right? But they didn't say, don't do it. Isn't that weird? Sometimes the more you get paid, the more meaningless the job actually becomes. You only get one life. It's too short to waste on things that you don't find fulfilling even though they might make you comfortable. Hey, gotta remember, if you choose a job you love,\nSpeaker 0: you'll never have to work a day in your life.\nSpeaker 0: If you don't learn and you don't love it, you might have to leave once you earn enough to take the leap.\nSpeaker 0: Now, let's talk about learning and earning.\nSpeaker 0: If it wasn't obvious already,\nSpeaker 0: it's the best. If you start a company or are early enough, you can learn while you earn. For founders, this is easy math. As a founder, when you start a company, you start off with a % of the pie. The pie might be worth zero at that moment, but you're gonna go make it worth something. If you do manage to get to product market fit, you could have a company with an exit in the tens of millions, hundreds of millions, or billions of dollars. If you own 10 to 30% of that company by then, you could be a centimillionaire to billionaire.\nSpeaker 0: That's pretty crazy. For employees,\nSpeaker 0: you might have 25 basis points, point 25%,\nSpeaker 0: up to 2% or more.\nSpeaker 0: It can still be an outrageously good outcome and you might not even have to take as big a risk. And being early means you might get less equity but you're not starting at a point where the company is literally worth nothing.\nSpeaker 0: It can still be an amazing deal especially if the company is growing very fast.\nSpeaker 0: When I was at Palantir,\nSpeaker 0: I was learning how to run teams\nSpeaker 0: and how to build product from scratch,\nSpeaker 0: but also earning equity in what ended up becoming a $40,000,000,000\nSpeaker 0: company. When I worked at Y Combinator, I was learning to be an investor and learning how to work with startups at the earliest possible stage. But I was also earning\nSpeaker 0: some of the most valuable carry\nSpeaker 0: that exists in Silicon Valley as a part of that investment firm. And I'm learning and earning every day now as the founder and managing partner of my own venture capital firm. I learn every day from founders that I get to meet and the problems that they run across. When it comes to YouTube, I'm doing this for fun. I donate the proceeds from this channel to nonprofits like Code twenty forty. So while I don't earn here, I do learn a ton from all of you. So keep the comments and DMs coming. Hearing what resonates for you and helps you is what helps me learn the most of all.\nSpeaker 0: Finally, are places where you don't get to do learning or earning at all. It might be working at a non tech company, a consulting firm and you're getting no equity and a low pay. Or what's worse, might be working at a bad start up. Really sorry if that's true for you. I remember working for a start up as an intern my junior year of college. I got the internship through the Stanford career fair and I'd never worked at a bad startup before by then. It was an enterprise software startup that raised money but never seemed to close customers. The founder spent a lot of time on business trips and I did a lot of work that summer creating marketing material, mock ups and prototypes and screenshots to use in sales pitches. But they didn't close an entire sale my whole summer. I don't think they ever did. The startup died and I didn't earn much because interns don't get paid a lot, but I didn't learn very much either. It was basically a wash. I ate a lot of McDonald's and watched a lot of Hong Kong movies. This is sort of the secret truth of bad startups and I hate to say it, but if you're in a situation like that, you should leave. If you're not learning, you don't have a way to earn equity or even a good salary, and especially if it's not fun or meaningful for you, you gotta quit.\nSpeaker 0: So what order do you do all of these things in? Here's what I recommend.\nSpeaker 0: Learn first,\nSpeaker 0: then earn. That's the best strategy.\nSpeaker 0: If you try and do it in reverse and you try to earn first, you'll probably still learn,\nSpeaker 0: but maybe slowly and you don't know what you're gonna give up. It might come at a great cost.\nSpeaker 0: And you also might get trapped in that hedonic treadmill.\nSpeaker 0: Always remember, if you're not learning or earning, you gotta plot your exit to a place where you can. Just to close it out, I like this snippet of Tim Cook talking about his journey\nSpeaker 0: from where he started to the CEO\nSpeaker 0: of Apple. For me,\nSpeaker 4: the journey\nSpeaker 4: was not predictable\nSpeaker 4: at all.\nSpeaker 4: And the it goes sort of back to the Lincoln quote is the only thing I believe you can do is prepare.\nSpeaker 0: So\nSpeaker 0: that's it for this week. If you want to learn about other startup topics like what to do after you raise money or how to do design if you've never done it before, check out the latest videos on my channel where I dive into those topics and tons of other stuff. New videos here every single week. So don't miss them. Click subscribe and the bell icon right now. Turn on notifications for YouTube, and you're gonna get a little notification every time I post.\nSpeaker 0: Thanks for watching, and I will see you next week.\n"
  }
]